gargulias/ESP8266D1MINI/esp8266d1mini.c
/*
 * WeMos D1 mini /ESP8266/ control by Ruben Lachinov
 * В программе необходимо записать параметры своей сети
 * const char* ssid = "__________";         //имя WiFi сети (WiFi router)
 * const char* password = "____________";   //ключ или пароль WiFi сети (WiFi router) 
 * На COM терминале получил адрес 192.168.0.103 (иногда другой)
 * На компьютере в браузере вбил адрес и получил ответ от модуля.
*/


#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
//#include <WiFiClient.h>
#include <pgmspace.h>   //PROGMEM

const static char file0[] PROGMEM =
  "<!DOCTYPE html PUBLIC '-//W3C//DTD XHTML 1.0 Transitional//EN'>\n\r"
  "<meta http-equiv='Content-Type' content='text/html; charset=UTF-8' />\n\r"
  "<meta name=viewport content=\"width=device-width, initial-scale=1\">\n\r"
  "<html>\n\r"
  "<head>\n\r"
  "<title>WeMos D1 mini - ESP8266 Control</title>\n\r"
  "<style type=\"text/css\">\n\r"
  ".onoffswitch {\n\r"
  "position: relative;\n\r"
  "width: 24px;\n\r"
  "-webkit-user-select:none;\n\r"
  "-moz-user-select:none;\n\r"
  "-ms-user-select: none;}\n\r"
  ".onoffswitch-checkbox {\n\r"
  "display: none;}\n\r"
  ".onoffswitch-label {\n\r"
  "display: block;\n\r"
  "overflow: hidden;\n\r"
  "cursor: pointer;\n\r"
  "border: 2px solid #8084B0;\n\r"
  "border-radius: 10px;}\n\r"
  ".onoffswitch-inner {\n\r"
  "display: block;\n\r"
  "width: 200%;\n\r"
  "margin-left: 0%; /*1*/\n\r"
  "transition: margin 0.3s ease-in 0s;}\n\r"
  ".onoffswitch-inner:before, .onoffswitch-inner:after {\n\r"
  "display: block;\n\r"
  "float: left;\n\r"
  "width: 50%;\n\r"
  "height: 6px;\n\r"
  "padding: 0;\n\r"
  "line-height: 6px;\n\r"
  "font-size: 14px;\n\r"
  "color: white;\n\r"
  "font-family: Trebuchet, Arial, sans-serif;\n\r"
  "font-weight: bold;\n\r"
  "box-sizing: border-box;}\n\r"
  ".onoffswitch-inner:before {\n\r"
  "content: \"\";\n\r"
  "padding-left: 10px;\n\r"
  "background-color: #FF0000;\n\r"
  "color: #999999;}\n\r"
  ".onoffswitch-inner:after {\n\r"
  "content: \"\";\n\r"
  "padding-right: 10px;\n\r"
  "background-color: #0AFF0A;\n\r"
  "color: #FFFFFF;\n\r"
  "text-align: right;}\n\r"
  ".onoffswitch-switch {\n\r"
  "display: block;\n\r"
  "width: 10px;\n\r"
  "margin: -2px;\n\r"
  "background: #FFFFFF;\n\r"
  "position: absolute;\n\r"
  "top: 0;\n\r"
  "bottom: 0;\n\r"
  "right: 14px; /*???2*/\n\r"
  "border: 2px solid #8084B0;\n\r"
  "border-radius: 10px;\n\r"
  "transition: all 0.3s ease-in 0s;}\n\r";

const static char file1[] PROGMEM =
  ".onoffswitch-switch2 {\n\r"
  "display: block;\n\r"
  "width: 10px;\n\r"
  "margin: -2px;\n\r"
  "background: #FFFFFF;\n\r"
  "position: absolute;\n\r"
  "top: 0;\n\r"
  "bottom: 0;\n\r"
  "right: 0px;\n\r"
  "border: 2px solid #8084B0;\n\r"
  "border-radius: 10px;\n\r"
  "transition: all 0.3s ease-in 0s;}\n\r"
  ".onoffswitch-checkbox:checked + .onoffswitch-label .onoffswitch-inner {\n\r"
  "margin-left: -100%;}\n\r"
  ".onoffswitch-checkbox:checked + .onoffswitch-label .onoffswitch-switch {\n\r"
  "right: 0px;}\n\r"
  ".onoffswitch-checkbox:checked + .onoffswitch-label .onoffswitch-switch2 {\n\r"
  "right: 14px;}\n\r"
  ".onoffswitch-inner2 {\n\r"
  "display: block;\n\r"
  "width: 200%;\n\r"
  "margin-left: -100%;\n\r"
  "transition: margin 0.3s ease-in 0s;}\n\r"
  ".onoffswitch-inner2:before, .onoffswitch-inner2:after {\n\r"
  "display: block;\n\r"
  "float: left;\n\r"
  "width: 50%;\n\r"
  "height: 6px;\n\r"
  "padding: 0;\n\r"
  "line-height: 6px;\n\r"
  "font-size: 14px;\n\r"
  "color: white;\n\r"
  "font-family: Trebuchet, Arial, sans-serif;\n\r"
  "font-weight: bold;\n\r"
  "box-sizing: border-box;}\n\r"
  ".onoffswitch-inner2:before {\n\r"
  "content: \"\";\n\r"
  "padding-right: 10px;\n\r"
  "background-color: #0AFF0A;\n\r"
  "color: #FFFFFF;\n\r"
  "text-align: right;}\n\r"
  ".onoffswitch-inner2:after {\n\r"
  "content: \"\";\n\r"
  "padding-left: 10px;\n\r"
  "background-color: #FF0000;\n\r"
  "color: #999999;}\n\r"
  ".onoffswitch-checkbox:checked + .onoffswitch-label .onoffswitch-inner2 {\n\r"
  "margin-left: 0;}\n\r"
  ".out_val {\n\r"
  "-webkit-appearance: none;\n\r"
  "appearance: none;\n\r"
  "padding: 0;\n\r"
  "margin-left:40px;\n\r"
  "border: 2px solid #eee;\n\r"
  "border-radius: 2px;\n\r"
  "box-shadow: inset 0 1px #ccc, inset 0 1px #575555, inset 0 -1px #00c;\n\r"
  "background: #fef linear-gradient(#BCBCBC, #fff0f5);\n\r"
  "overflow: hidden;}\n\r";

const static char file2[] PROGMEM =
  "div.ex_output {\n\r"
  "width:258px;\n\r"
  "text-align:center;\n\r"
  "background-color: #000080;\n\r"
  "margin-left:6px;}\n\r"
  "div.ex_output output {\n\r"
  "font-weight:bold;\n\r"
  "font-size:16px;\n\r"
  "color: #CCC;}\n\r"
  "div.output {\n\r"
  "width:80px;\n\r"
  "background-color: #EFE3CF;\n\r"
  "border: 2px solid #006;\n\r"
  "text-align:center;\n\r"
  "margin-bottom:4px;\n\r"
  "margin-right:2px;\n\r"
  "float:left;}\n\r"
  "div.output div {\n\r"
  "width:80px;\n\r"
  "background-color:#C1C5F7;}\n\r"
  "div.output output {\n\r"
  "font-weight:bold;\n\r"
  "font-size:16px;\n\r"
  "color:#009;}\n\r"
  ".rangeP {\n\r"
  "-webkit-appearance: none;\n\r"
  "appearance: none;\n\r"
  "padding: 0;\n\r"
  "border: 2px solid #eee;\n\r"
  "border-radius: 2px;\n\r"
  "background: #fef linear-gradient(#BCBCBC, #fff0f5);\n\r"
  "overflow: hidden;}\n\r"
  ".rangeP::-moz-range-thumb {\n\r"
  "border-radius: 2px;\n\r"
  "box-shadow: -13px 0 #40310a, -26px 0 #40310a, -39px 0 #40310a, -52px 0 #40310a, -65px 0 #40310a, -78px 0 #40310a, -91px 0 #40310a, -104px 0 #40310a, -117px 0 #40310a, -130px 0 #40310a, -143px 0 #40310a, -156px 0 #40310a;}\n\r"
  ".rangeP::-moz-range-track {\n\r"
  "background: none;\n\r"
  "border: none;}\n\r"
  ".rangeP::-webkit-slider-thumb {\n\r"
  "-webkit-appearance: none;\n\r"
  "width:15px;\n\r"
  "height:8px;\n\r"
  "border: 1px solid #000081;\n\r"
  "border-radius: 2px;\n\r"
  "background-image:linear-gradient(#dedede, #8282ff);\n\r"
  "box-shadow: -13px 0 #1c59f4, -26px 0 #1c59f4, -39px 0 #1c55eb, -52px 0 #1c50db, -65px 0 #1b49c9, -78px 0 #1b43b7, -91px 0 #1b3a9e, -104px 0 #1b338d, -117px 0 #1b2d7a, -130px 0 #1b286e, -143px 0 #1b286d, -156px 0 #1b2566;}\n\r"
  ".column_view-off {\n\r"
  "display: none;\n\r"
  "text-align: center;\n\r"
  "color: #000;}\n\r"
  ".column_view-on {\n\r"
  "background-color: #BBBEFF;}\n\r"
  ".mode_view-off {\n\r"
  "display: none;}\n\r"
  ".mode_view-on {\n\r"
  "background-color: #D1D2F3;}\n\r";


const static char file3[] PROGMEM =
".but {\n\r"
"display: block;\n\r"
"width: 14px;\n\r"
"height: 12px;\n\r"
"margin: 5px;\n\r"
"background:  #DDD1CC;\n\r"
"-webkit-border-radius: 22px;\n\r"
"-moz-border-radius: 22px;\n\r"
"border-radius: 22px;\n\r"
"cursor:pointer;\n\r"
"-webkit-box-shadow: 0 0 8px rgba(0, 0, 0, .75);\n\r"
"-moz-box-shadow: 0 0 8px rgba(0, 0, 0, .75);\n\r"
"box-shadow: 1px 1px 8px rgba(0, 0, 0, .75);\n\r"
"border-top: 1px solid #b5b5b5;\n\r"
"-webkit-box-shadow: \n\r"
" inset 0 0 25px #e8e8e8, 0 1px 0 #c3c3c3, 0 2px 0 #c9c9c9, 0 2px 3px #333;\n\r"
"-moz-box-shadow: \n\r"
" inset 0 0 25px #e8e8e8, 0 1px 0 #c3c3c3, 0 2px 0 #c9c9c9, 0 2px 3px #333;\n\r"
"box-shadow: \n\r"
" inset 0 0 25px #e8e8e8, 0 1px 0 #c3c3c3, 0 2px 0 #c9c9c9, 0 2px 3px #333;\n\r"
"}\n\r"
".but:active, .keydown {\n\r"
"background: #D9D9FF;\n\r"
"margin: 7px 5px 3px;\n\r"
"-webkit-box-shadow:\n\r"
" inset 0 0 25px #d0d, 0 0 3px #333;\n\r"
"-moz-box-shadow: \n\r"
" inset 0 0 25px #d0d, 0 0 3px #333;\n\r"
"box-shadow: \n\r"
" inset 0 0 25px #d0d, 0 0 3px #333;\n\r"
"border-top: 1px solid #eee;\n\r"
"}\n\r"
"</style>\n\r";
  

const static char file4[] PROGMEM =
  "<script type= \"text/javascript\">\n\r"
  "var str_URL = \"\"; var x =\"\"; var y =\"\";\n\r"
  "function cb_check0(id_cb){\n\r"
  "x = id_cb.name;\n\r"
  "if (id_cb.checked){\n\r"
  "str_URL=x+\"=1\";}else{str_URL=x+\"=0\";}\n\r"
  "trans_par(id_cb);}\n\r"
  "function cb_check(id_cb){\n\r"
  "x = id_cb.name;\n\r"
  "y = \"c\" + id_cb.id;\n\r"
  "var rng = document.getElementById(y);\n\r"
  "if (id_cb.checked){\n\r"
  "str_URL=x+\"=1\";\n\r"
  "if (rng){rng.value = rng.max;sd_index(id_cb);}}else{str_URL=x+\"=0\";\n\r"
  "if (rng){rng.value = rng.min;}}\n\r"
  "trans_par(id_cb);}\n\r"
  "function cb_check2(id_cb){\n\r"
  "x = id_cb.name;\n\r"
  "y = \"c\" + id_cb.id;\n\r"
  "var rng = document.getElementById(y);\n\r"
  "if (id_cb.checked){\n\r"
  "str_URL=x+\"=0\";\n\r"
  "if (rng){rng.value = rng.min;}}else{str_URL=x+\"=1\";if (rng){rng.value = rng.max;}}\n\r"
  "trans_par(id_cb);}\n\r"
  "function ce_but(id_cb){x = id_cb.id;str_URL=x+\"=0\";trans_par(id_cb);}\n\r"
  "function sel_test(id_cb){\n\r"
  "var colo = id_cb.options[id_cb.selectedIndex].index;\n\r"
  "switch (colo) {case 0: set_color(id_cb, \"#94fff8\"); break\n\r"
  "case 1: set_color(id_cb, \"#fff894\"); break\n\r"
  "case 2: set_color(id_cb, \"#f294ff\"); break\n\r"
  "default: set_color(id_cb, \"#FFFFFF\"); break}\n\r"
  "x = id_cb.id;str_URL = x+\"=\" + colo;\n\r"
  "trans_par(id_cb);}\n\r"
  "function set_color(el, cl) {el.style.backgroundColor = cl;}\n\r"
  "function trans_par(id_cb){var xmlhttp = getXmlHttp();\n\r"
  "var str_URL2=\"/\" + \"?\" + str_URL;\n\r"
  "xmlhttp.open(\"GET\", str_URL2, true);\n\r"
  "var http = new XMLHttpRequest(), href = this.href;\n\r"
  "http.open(\"GET\", str_URL2);\n\r"
  "http.setRequestHeader(\"Content-Type\", \"application/x-www-form-urlencoded\");\n\r"
  "http.timeout = 2000;\n\r"
  "xmlhttp.onreadystatechange = function()\n\r"
  "{if (xmlhttp.readyState == 4){if(xmlhttp.status == 200){x = xmlhttp.responseText;getParam(x);}}}\n\r"
  "xmlhttp.send(null);}\n\r";


//String file3a = "";

const static char file5[] PROGMEM =
  "function getXmlHttp(){try {return new ActiveXObject(\"Msxml2.XMLHTTP\");}catch (e){try {return new ActiveXObject(\"Microsoft.XMLHTTP\");}catch (ee){}}if (typeof XMLHttpRequest!=\"undefined\"){return new XMLHttpRequest();}}\n\r"
  "function polsun_val(id_cb){\n\r"
  "var x = id_cb.id;\n\r"
  "var newstr = x.replace(new RegExp(\"cd\"),\"d\");\n\r"
  "if (id_cb.value >0)\n\r"
  "{document.getElementById(newstr).checked=true;}else{document.getElementById(newstr).checked=false;}\n\r"
  "str_URL = id_cb.id+\"=\" + id_cb.value;\n\r"
  "document.getElementById(\"result1\").value = str_URL;\n\r"
  "sd_index(id_cb);trans_par(id_cb);}\n\r"
  "function test_val1(id_cb){x = id_cb.name;str_io = x + \"=\" + id_cb.value;str_URL = id_cb.value;document.getElementById(\"result1\").value = str_io;}\n\r"
  "function getParam(get) {\n\r"
  "var tmp = new Array(); var tmp2 = new Array(); var param = new Array();\n\r"
  "if (get != \"\") {\n\r"
  "tmp = (get.substr(1)).split(\"&\");\n\r"
  "for (var i = 0; i < tmp.length; i++) {\n\r"
  "tmp2 = tmp[i].split(\"=\");\n\r"
  "param[tmp2[0]] = tmp2[1];}\n\r"
  "for (var key in param) {\n\r"
  "if (param[key] != \"\") {\n\r"
  "if (key.indexOf(\"cb\") >= 0) {\n\r"
  "var newstr = key.replace(new RegExp(\"cb\"), \"d\");\n\r"
  "if (param[key] > 0) {\n\r"
  "document.getElementById(newstr).checked = true;\n\r"
  "} else {\n\r"
  "document.getElementById(newstr).checked = false;}\n\r"
  "} else {\n\r"
  "document.getElementById(key).value = param[key];\n\r"
  "}}}}}\n\r"
  "function toggleView(source, tableId, tag) {\n\r"
  "var elems = document.getElementById(tableId).getElementsByTagName(tag);\n\r"
  "for (i = 0; i < elems.length; ++i) {toggleClasses(elems[i], \"column_view-off\", \"column_view-on\");}\n\r"
  "return false;}\n\r";


const static char file6[] PROGMEM =
  "function toggleView_mode(source, tableId, tag) {\n\r"
  "var elems = document.getElementById(tableId).getElementsByTagName(tag);\n\r"
  "for (i = 0; i < elems.length; ++i) {toggleClasses(elems[i], \"mode_view-off\", \"mode_view-on\");}\n\r"
  "return false;}\n\r"
  "function toggleClasses(elem, className1, className2) {var clazz = elem.className.toString();\n\r"
  "if (clazz.indexOf(className1) >= 0) {elem.className = clazz.replace(className1, className2);} else if (clazz.indexOf(className2) >= 0) {elem.className = clazz.replace(className2, className1);}}\n\r"
  "function startTimer() {\n\r"
  "var my_timer = document.getElementById(\"my_timer\");\n\r"
  "var time = my_timer.innerHTML;\n\r"
  "var arr = time.split(\":\");\n\r"
  "var h = arr[0];\n\r"
  "var m = arr[1];\n\r"
  "var s = arr[2];\n\r"
  "if (s == 0) {\n\r"
  "if (document.getElementById(\"tt1\").checked){\n\r"
  "str_URL = \"zz=0\";\n\r"
  "trans_par(document.getElementById(\"ce1\"));}\n\r"
  "s = document.getElementById(\"r_sec\").value;}\n\r"
  "else s--;\n\r"
  "if (s < 10) s = \"0\" + s;\n\r"
  "if (document.getElementById(\"tt1\").checked){\n\r"
  "document.getElementById(\"my_timer\").innerHTML = h+\":\"+m+\":\"+s;}\n\r"
  "setTimeout(startTimer, 1000);}\n\r"
  "function sd_index(id_cb){\n\r"
  "if (id_cb.id[0] == \"c\"){\n\r"
  "var l = id_cb.id.length;\n\r"
  "var sd = \"s\";\n\r"
  "for(var i=1; i < id_cb.id.length; i++)\n\r"
  "sd = sd + id_cb.id[i];\n\r"
  "}else{\n\r"
  "sd = \"s\" + id_cb.id;}\n\r"
  "var indout = document.getElementById(sd);\n\r"
  "if (document.getElementById(\"ce1\").checked){\n\r"
  "indout.selectedIndex  = 1;\n\r"
  "indout.style.backgroundColor = \"#fff894\";};}\n\r"
  "</script></head>\n\r";


