gargulias/ESP8266D1MINI/esp8266d1mini.c
const static char file7[] PROGMEM =
  "<body onload=\"startTimer()\">\n\r"
  "<div class= \"ex_output\">\n\r"
  "<output id=\"ex_out\"><span>WeMos D1 mini Control v1.03</span></output>\n\r"
  "</div>\n\r"
  "<table border=\"0\">\n\r"
  "<tr>\n\r"
  "<td width=\"86\"><div class=\"output\">\n\r"
  "<div><span>Can 1 = A0</span></div>\n\r"
  "<output id=\"out1\">0</output>\n\r"
  "</div></td>\n\r"
  "<td width=\"86\"><div class=\"output\">\n\r"
  "<div><span>Can 2</span></div>\n\r"
  "<output id=\"out2\">0</output>\n\r"
  "</div></td>\n\r"
  "<td width=\"86\"><div class=\"output\">\n\r"
  "<div><span>Can 3</span></div>\n\r"
  "<output id=\"out3\">0</output>\n\r"
  "</div></td>\n\r"
  "</tr>\n\r"
  "<tr>\n\r"
  "<td>&nbsp;&nbsp;\n\r"
  "<input type=\"number\" min=\"1\" max=\"59\" step=\"1\" id=\"r_sec\" style=\"width:72; text-align:center\" value=\"5\"/></td>\n\r"
  "<td><input type=\"checkbox\" id=\"tt1\" name=\"tt1\" onclick=\"cb_check0(this)\" />\n\r"
  "avto</td>\n\r"
  "<td align=\"center\"><span id=\"my_timer\" style=\"color: #f00;  font-weight: bold;\">00:00:10</span></td>\n\r"
  "</tr>\n\r"
  "<tr align=\"center\">\n\r"
  "<td><input type=\"button\" id=\"52\" value=\"PWM\" onclick=\"return toggleView(this, 'data-table', 'td')\" style=\"width:64px\" /></td>\n\r"
  "<td>output\n\r"
  "<input type=\"checkbox\" id=\"ce1\" name=\"ce1\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td><input type=\"button\" id=\"522\" value=\"mode\" onclick=\"return toggleView_mode(this, 'data-table', 'td')\" style=\"width:64px\" /></td>\n\r"
  "</tr>\n\r"
  "</table>\n\r";



const static char file8[] PROGMEM =
  "<table id=\"data-table\">\n\r"
  "<tbody>\n\r"
  "<tr bgcolor=\"#CCCCCC\">\n\r"
  "<td align=\"center\"><strong>on/off</strong></td>\n\r"
  "<td align=\"center\" class=\"column_view-m column_view-off\" style=\"background-color:#00C\">&nbsp;</td>\n\r"
  "<td align=\"center\" class=\"mode_view-m mode_view-off\"><strong>i</strong></td>\n\r"
  "<td align=\"center\" class=\"mode_view-m mode_view-off\"><strong>mode</strong></td>\n\r"
  "<td align=\"center\"><strong>pin</strong></td>\n\r"
  "<td align=\"center\"><strong>instr</strong></td>\n\r"
  "<td align=\"center\" bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td align=\"center\"><strong>instr</strong></td>\n\r"
  "<td align=\"center\"><strong>pin</strong></td>\n\r"
  "<td align=\"center\" class=\"mode_view-m mode_view-off\"><strong>mode</strong></td>\n\r"
  "<td width=\"20\" align=\"center\" class=\"mode_view-m mode_view-off\"><strong>i</strong></td>\n\r"
  "<td align=\"center\" class=\"column_view-m column_view-off\" style=\"background-color:#00C\"><span class=\"out_val\">\n\r"
  "<output id=\"result1\">0</output>\n\r"
  "</span></td>\n\r"
  "<td width=\"34\" align=\"center\"><strong>on/off</strong></td>\n\r"
  "</tr>\n\r"
  "<tr>\n\r"
  "<td width=\"38\"><div class=\"but\" id=\"cb17\" onclick=\"ce_but(this)\" style=\"background-color:  #FF0E0E;\" /></td>\n\r"
  "<td width=\"148\" class=\"column_view-m column_view-off\">reset</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td width=\"36\">&nbsp;</td>\n\r"
  "<td width=\"53\">reset</td>\n\r"
  "<td width=\"1\" bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td>GPIO1</td>\n\r"
  "<td>D10</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\">TXD0</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td align=\"center\" class=\"column_view-m column_view-off\">&nbsp;</td>\n\r";


const static char file9[] PROGMEM =
  "<td><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb1\" class=\"onoffswitch-checkbox\" id=\"d1\" onclick=\"cb_check0(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d1\"> <span class=\"onoffswitch-inner2\"></span> <span class=\"onoffswitch-switch\"></span></label>\n\r"
  "</div></td>\n\r"
  "</tr>\n\r"
  "<tr>\n\r"
  "<td bgcolor=\"#CCCCCC\"><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cbA0\" class=\"onoffswitch-checkbox\" id=\"A0\" onclick=\"cb_check(this)\" />\n\r"
  "<label class=\"onoffswitch-label\" for=\"A0\"> <span class=\"onoffswitch-inner\"></span> <span class=\"onoffswitch-switch2\"></span></label>\n\r"
  "</div></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"column_view-m column_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><select id=\"sdA0\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td bgcolor=\"#CCCCCC\">A0</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">ADC0</td>\n\r"
  "<td bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">GPIO3</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">D9</td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\">RXD0</td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td align=\"center\" bgcolor=\"#CCCCCC\" class=\"column_view-m column_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#CCCCCC\"><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb3\" class=\"onoffswitch-checkbox\" id=\"d3\" onclick=\"cb_check0(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d3\"> <span class=\"onoffswitch-inner2\"></span> <span class=\"onoffswitch-switch\"></span></label>\n\r"
  "</div></td>\n\r"
  "</tr>\n\r";


const static char file10[] PROGMEM =
  "<tr>\n\r"
  "<td><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb16\" class=\"onoffswitch-checkbox\" id=\"d16\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d16\"> <span class=\"onoffswitch-inner\"></span> <span class=\"onoffswitch-switch2\"></span></label>\n\r"
  "</div></td>\n\r"
  "<td align=\"center\" class=\"column_view-m column_view-off\" width=\"148\">&nbsp;</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci16\" name=\"ci16\" onclick=\"cb_check0(this)\" disabled=\"disabled\"/></td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><select id=\"sd16\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\"  selected=\"selected\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td>D0</td>\n\r"
  "<td>GPIO16</td>\n\r"
  "<td bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td>GPIO5</td>\n\r"
  "<td>D1</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><select id=\"sd5\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci5\" name=\"ci5\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td align=\"center\" bgcolor=\"#CCCCCC\" class=\"column_view-m column_view-off\"><input type=\"range\" onchange=\"polsun_val(this)\" class=\"rangeP\" id=\"cd5\" value=\"0\" max=\"1023\" min=\"0\" /></td>\n\r"
  "<td><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb5\" class=\"onoffswitch-checkbox\" id=\"d5\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d5\"><span class=\"onoffswitch-inner2\"></span> <span class=\"onoffswitch-switch\"></span></label>\n\r"
  "</div></td>\n\r"
  "</tr>\n\r";


const static char file11[] PROGMEM =
  "<tr>\n\r"
  "<td width=\"38\" bgcolor=\"#CCCCCC\"><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb14\" class=\"onoffswitch-checkbox\" id=\"d14\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d14\"> <span class=\"onoffswitch-inner\"></span> <span class=\"onoffswitch-switch2\"></span></label>\n\r"
  "</div></td>\n\r"
  "<td align=\"center\" bgcolor=\"#CCCCCC\" class=\"column_view-m column_view-off\"><input type=\"range\" onchange=\"polsun_val(this)\" class=\"rangeP\" id=\"cd14\" value=\"0\" max=\"1023\" min=\"0\" /></td>\n\r"
  "<td width=\"20\" bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci14\" name=\"ci14\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><select id=\"sd14\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td bgcolor=\"#CCCCCC\">D5</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">GPIO14</td>\n\r"
  "<td bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">GPIO4</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">D2</td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><select id=\"sd4\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci4\" name=\"ci4\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" align=\"center\" class=\"column_view-m column_view-off\"><input type=\"range\" onchange=\"polsun_val(this)\" class=\"rangeP\" id=\"cd4\" value=\"0\" max=\"1023\" min=\"0\" /></td>\n\r";


