gargulias/ESP8266D1MINI/esp8266d1mini.c
const static char file12[] PROGMEM =
  "<td bgcolor=\"#CCCCCC\"><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb4\" class=\"onoffswitch-checkbox\" id=\"d4\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d4\" > <span class=\"onoffswitch-inner2\"></span> <span class=\"onoffswitch-switch\"></span></label>\n\r"
  "</div></td>\n\r"
  "</tr>\n\r"
  "<tr>\n\r"
  "<td><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb12\" class=\"onoffswitch-checkbox\" id=\"d12\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d12\"> <span class=\"onoffswitch-inner\"></span> <span class=\"onoffswitch-switch2\"></span></label>\n\r"
  "</div></td>\n\r"
  "<td align=\"center\" class=\"column_view-m column_view-off\"><input type=\"range\" onchange=\"polsun_val(this)\" class=\"rangeP\" id=\"cd12\" value=\"0\" max=\"1023\" min=\"0\" /></td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci12\" name=\"ci12\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><select id=\"sd12\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td>D6</td>\n\r"
  "<td>GPIO12</td>\n\r"
  "<td bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td>GPIO0</td>\n\r"
  "<td>D3</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><select id=\"sd0\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci0\" name=\"ci0\" onclick=\"cb_check0(this)\" /></td>\n\r";

const static char file13[] PROGMEM =
  "<td align=\"center\" bgcolor=\"#CCCCCC\" class=\"column_view-m column_view-off\"><input type=\"range\" onchange=\"polsun_val(this)\" class=\"rangeP\" id=\"cd0\" value=\"0\" max=\"1023\" min=\"0\" /></td>\n\r"
  "<td><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb0\" class=\"onoffswitch-checkbox\" id=\"d0\" onclick=\"cb_check(this)\" />\n\r"
  "<label class=\"onoffswitch-label\" for=\"d0\"> <span class=\"onoffswitch-inner2\"></span> <span class=\"onoffswitch-switch\"></span></label>\n\r"
  "</div></td>\n\r"
  "</tr>\n\r"
  "<tr>\n\r"
  "<td bgcolor=\"#CCCCCC\"><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb13\" class=\"onoffswitch-checkbox\" id=\"d13\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d13\"> <span class=\"onoffswitch-inner\"></span> <span class=\"onoffswitch-switch2\"></span></label>\n\r"
  "</div></td>\n\r"
  "<td align=\"center\" bgcolor=\"#CCCCCC\" class=\"column_view-m column_view-off\"><input type=\"range\" onchange=\"polsun_val(this)\" class=\"rangeP\" id=\"cd13\" value=\"0\" max=\"1023\" min=\"0\" /></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci13\" name=\"ci13\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><select id=\"sd13\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td bgcolor=\"#CCCCCC\">D7</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">GPIO13</td>\n\r"
  "<td bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">GPIO2</td>\n\r"
  "<td bgcolor=\"#CCCCCC\">D4</td>\n\r";


const static char file14[] PROGMEM =
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><select id=\"sd2\" onchange=\"sel_test(this)\">\n\r"
  "<option  style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci2\" name=\"ci2\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td bgcolor=\"#CCCCCC\" align=\"center\" class=\"column_view-m column_view-off\"><input type=\"range\" onchange=\"polsun_val(this)\" class=\"rangeP\" id=\"cd2\" value=\"0\" max=\"1023\" min=\"0\" /></td>\n\r"
  "<td bgcolor=\"#CCCCCC\"><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb2\" class=\"onoffswitch-checkbox\" id=\"d2\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d2\"><span class=\"onoffswitch-inner2\"></span> <span class=\"onoffswitch-switch\"></span></label>\n\r"
  "</div></td>\n\r"
  "</tr>\n\r"
  "<tr>\n\r"
  "<td><div class=\"onoffswitch\">\n\r"
  "<input type=\"checkbox\" name=\"cb15\" class=\"onoffswitch-checkbox\" id=\"d15\" onclick=\"cb_check(this)\"/>\n\r"
  "<label class=\"onoffswitch-label\" for=\"d15\"> <span class=\"onoffswitch-inner\"></span><span class=\"onoffswitch-switch2\"></span></label>\n\r"
  "</div></td>\n\r"
  "<td align=\"center\" class=\"column_view-m column_view-off\">&nbsp;</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><input type=\"checkbox\" id=\"ci15\" name=\"ci15\" onclick=\"cb_check0(this)\" /></td>\n\r"
  "<td class=\"mode_view-m mode_view-off\"><select id=\"sd15\" onchange=\"sel_test(this)\">\n\r"
  "<option style=\"background-color: #d9fffe\">Input</option>\n\r"
  "<option style=\"background-color: #fffed9\" selected=\"selected\">Output</option>\n\r"
  "</select></td>\n\r";


const static char file15[] PROGMEM =
  "<td>D8</td>\n\r"
  "<td>GPIO15</td>\n\r"
  "<td bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td>&nbsp;</td>\n\r"
  "<td>GND</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td align=\"center\" class=\"column_view-m column_view-off\">&nbsp;</td>\n\r"
  "<td>&nbsp;</td>\n\r"
  "</tr>\n\r"
  "<tr>\n\r"
  "<td bgcolor=\"#E10000\" style=\"font-size:18px; font-weight:600\">&nbsp;&larr;</td>\n\r"
  "<td bgcolor=\"#E10000\" class=\"column_view-m column_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#E10000\" class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#E10000\" class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#FFFF9D\">3.3v</td>\n\r"
  "<td bgcolor=\"#E10000\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#666666\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#E10000\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#FFFF9D\">5v</td>\n\r"
  "<td bgcolor=\"#E10000\" class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#E10000\" class=\"mode_view-m mode_view-off\">&nbsp;</td>\n\r"
  "<td align=\"center\" bgcolor=\"#E10000\" class=\"column_view-m column_view-off\">&nbsp;</td>\n\r"
  "<td bgcolor=\"#E10000\" style=\"font-size:18px; font-weight: bold\">&nbsp;&rarr;</td>\n\r"
  "</tr></tbody></table>\n\r"
  "</body></html>\n\r";

const char* const string_table[] PROGMEM = {file0, file1, file2, file3, file4, file5, file6, file7, file8, file9,
                                            file10, file11, file12, file13, file14, file15};
const char* ssid = "office";                   //имя WiFi сети (WiFi router)
const char* password = "office2803";   //ключ или пароль WiFi сети (key WiFi router)

