gargulias/ESP8266D1MINI/esp8266d1mini.c
//const char* ssid = "Name_WiFi_net";         //имя WiFi сети (WiFi router)
//const char* password = "_____key_______";   //ключ или пароль WiFi сети (WiFi router)
String mess = "";
String priem = "";
int pin = 2;
int sos = 0;
//int Key_avto = 0;  //ключ передачи данных по таймеру
int Key_output = 1; //1- автоматически устанавливать mode = OUTPUT
int cikl_current = 1; //интервал ~1 сек
int cikl_avto = 1000; //кол-во циклов процессора для задержки второго послания данных
String RSS1 ="";
String RSS2 ="";
// TCP server at port 80 will respond to HTTP requests
WiFiServer server(80);
WiFiClient client = server.available();

void setup(void)
{
  initHardware();

  // Connect to WiFi network
  WiFi.begin(ssid, password);
  Serial.println("");

  // Wait for connection
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }
  Serial.println("R_WeMos_control_V1.13");
  Serial.print("Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
  IPAddress ip = WiFi.localIP();
  //file3a = "str_URL2=\"http://" + String(ip[0]) + '.' + String(ip[1]) + '.' + String(ip[2]) + '.' + String(ip[3]) + "/led?\" + str_URL;";
  if (!MDNS.begin("esp8266")) {
    Serial.println("Error setting up MDNS responder!");
    while (1) {
      delay(1000);
    }
  }
  Serial.println("mDNS responder started");
  // Start TCP (HTTP) server
  server.begin();
  Serial.println("TCP server started");
  // Add service to MDNS-SD
  MDNS.addService("http", "tcp", 80);
}

void loop(void) {
  // Check if a client has connected
  client = server.available();
  if (!client)
  {
    return;
  }
  Serial.println("");
  //Serial.println("New client");
  // Wait for data from client to become available
  while (client.connected() && !client.available()) {
    delay(1);
  }
  // Read the first line of HTTP request
  String req = client.readStringUntil('\r');
  Serial.println(req);            //ruben
  priem = req;                    //ruben
  mess = "";                      //ruben
  analis();                       //ruben
  delay(1);
}

void analis()
{
  int ind1 = priem.indexOf('?');              //граница начала данных
  int ind2 = priem.indexOf('=');              //граница
  String    zapros = priem.substring(ind1 + 1, ind2);    //cb2  (=0) или cbA0
  String vetka = zapros.substring(0, 2);
  //Serial.println(zapros);  //test
  zapros.remove(0, 2);                                   //2         или A0
  if (zapros != "A0") {
    pin = zapros.toInt();                     //Аналоговый вход A0 = 20
  } else {
    pin = 20;
  }
  priem.remove(0, ind2 + 1); //все после знака =         0 HTTP/1.1
  ind1 = priem.indexOf(' ');
  zapros = priem.substring(0, ind1); //все до пробела    0
  sos = zapros.toInt();              //преобразовали значение в цифру
  if (vetka == "GE" or vetka == "ne")     //первый запрос- проверка
  {
    client.flush();
    for (int i = 0; i < 16; i++)
    { mess = string_table[i];
      client.print(mess);
      delay( 10 );
    }
    /*
    client.print(file3a);
    for (int i = 4; i < 20; i++)
    { mess = string_table[i];
      client.print(mess);
      //mess = "";
      delay( 10 );
    }
    */

  } else {
    if (vetka == "cb")          //on/off
    {
      if (pin != 20) {
        if (pin == 17){  ESP.reset();// or
          //ESP.restart();
        }
        if (Key_output > 0)
        {
          pinMode(pin, OUTPUT);
          analogWrite(pin, 0); //для режима прямого управления
        }
        digitalWrite(pin, sos);
        mess = "digitalWrite(GPIO";
        form_mess(mess, pin, sos);
      } else {
        if (sos == 0) {
          pinMode(A0, OUTPUT);  //??
          mess = "pinMode(";
          form_mess(mess, pin, -2); //-2 OUTPUT
        } else {
          pinMode(A0, INPUT);
          mess = "pinMode(";  //-3 INPUT
          form_mess(mess, pin, -3);
        }
      }
    } else {
      if (vetka == "cd") {    //potenciometr
        if (pin != 20) {
          if (Key_output > 0)
          {
            pinMode(pin, OUTPUT);
          }
          analogWrite(pin, sos);
          mess = "analogWrite(GPIO";
          form_mess(mess, pin, sos);
        } else {
          //analogWrite(A0, sos);
        }
      } else {
        if (vetka == "sd")     //mode
        {
          switch (sos)
          {
            case 0: {
                if (pin == 20) {
                  pinMode(A0, INPUT);
                  mess = "pinMode(";
                  form_mess(mess, pin, -3);
                } else {
                  pinMode(pin, INPUT);
                  mess = " pinMode(GPIO";
                  form_mess(mess, pin, -3);
                }
                break;
              }
            case 1: {
                if (pin == 20) {
                  pinMode(A0, OUTPUT);
                  mess = "pinMode(";
                  form_mess(mess, pin, -2);
                } else {
                  pinMode(pin, OUTPUT);
                  mess = " pinMode(GPIO";
                  form_mess(mess, pin, -2);
                }
                break;
              }
            default: {
                Serial.println("mode ERROR - " + pin);
                break;
              }
          }
        } else {
          if  (vetka == "ci") {   //INTERRUPT
            switch (sos)
            {
              case 0: {
                  detachInterrupt(digitalPinToInterrupt(pin));
                  mess = "Interrupt disabled: GPIO";
                  form_mess(mess, pin, -1);

                  Serial.print("Interrupt disabled: pin ");
                  Serial.println(pin);
                  break;
                }
              case 1: {
                  attachInterrupt(digitalPinToInterrupt(pin), INTERRUPT_ok, CHANGE);
                  mess = "Interrupt enabled: GPIO";
                  form_mess(mess, pin, -1);
                  Serial.print("Interrupt enabled: pin ");
                  Serial.println(pin);
                  break;
                }
              default: {
                  Serial.println("Interrupt ERROR - " + pin);
                  break;
                }
            }
          } else {
            if (vetka == "ce") {
              Key_output = sos;               //_mess("Get result=&out2=34&out1=19&out3=test");
              if (sos == 0) {
                mess = "avtooutput turn-off = "; //знак равно автоматически выбросится из параметров
              }
              else {
                mess = "avtooutput turn-on = "; //знак равно автоматически выбросится из параметров
              }
              form_mess(mess, sos , -1);
            } else {
              if (vetka == "tt") {
                // Key_avto = sos;
                if (sos == 0) {
                  mess = "timer off = "; //знак равно автоматически выбросится из параметров
                }
                else {
                  mess = "timer on = ";  //знак равно автоматически выбросится из параметров
                }
                form_mess(mess, sos , -1);
              } else {
                if (vetka == "zz") { //запрос параметров
                  client.flush();
                  // char c = client.read();                       //провоцирующее чтение
                  mess = "Get result=&out1=" + String(analogRead(A0)) + "&out2=" + String(digitalRead(16)) + "&out3=t:"; //проверка передачи
                  mess += cikl_current;                         //параметров
                  cikl_current += 1;
                  client.print(mess); //просто передать без обновления RSS
                  //out_mess(mess);            //передача после любого запроса от клиента
                  out_par();                       //передача RSS
                  if (digitalRead(10) > 0) {
                    mess = "&cb10=0";
                  } else {
                    mess = "&cb10=1";
                  }
                  if (digitalRead(9) > 0) {
                    mess = mess + "&cb9=0";
                  } else {
                    mess = mess + "&cb9=1";
                  }
                  //mess ="&cb10="+String(digitalRead(10))+"&cb9="+String(digitalRead(9));
                  out_mess(mess);            //передача после любого запроса от клиента
                }
              }
            }
          }
        }
      }
    }      out_mess(mess);
  }
  // Serial.println("vetka - " + vetka + ", pin - " + pin + ", vol - " + sos);
}

void form_mess(String m_str, int spin, int ssos) {
  mess = "Get result=&ex_out=" + m_str;
  if (spin != 20) {
    mess += spin;
  } else {
    mess += "A0";
  }
  if (ssos != -1) {
    mess += ", ";
    if (ssos == -2) {
      mess += "OUTPUT";
    } else {
      if (ssos == -3) {
        mess += "INPUT";
      } else    mess += ssos;
    }
    mess += ");";
  }
  out_mess(mess);
}
void out_mess(String m_str)
{
  //Serial.print(m_str);
  client.flush();
  // отправляем запрос на сервер
  client.print(m_str);
  //Serial.println(m_str);
  //  delay(1000);
  str_par();; //обновить регистр состояния RSS1, Rss2
}

void out_par(void)
{
  client.print(RSS1);
  delay(20);
  client.print(RSS2);
}
void str_par(void)
{
  RSS1 = "&cb16=" + String(digitalRead(16)) + "&cb5=" + String(digitalRead(5)) + "&cb4=" + String(digitalRead(4)) + 
         "&cb0=" + String(digitalRead(0)) + "&cb2=" + String(digitalRead(2));
  RSS2 = "&cb14=" + String(digitalRead(14)) + "&cb12=" + String(digitalRead(12)) + "&cb13=" + String(digitalRead(13)) +
         "&cb15=" + String(digitalRead(15)) + "&cb3=" + String(digitalRead(3))  + "&cb1=" + String(digitalRead(1));  
}

void INTERRUPT_ok()
{
  switch (pin) {
    case 0: {
        break;
      }
    case 2: {
        break;
      }
    case 4: {
        digitalWrite(16,  HIGH);
        digitalWrite(2, LOW);
        delay(300);
        digitalWrite(16, LOW);
        digitalWrite(2,  HIGH);
        delay(300);
        digitalWrite(16,  HIGH);
        digitalWrite(2, LOW);
        delay(300);
        digitalWrite(16, LOW);
        digitalWrite(2,  HIGH);
        delay(300);
        digitalWrite(16,  HIGH);
        digitalWrite(2, LOW);
        delay(300);
        digitalWrite(16, LOW);
        digitalWrite(2,  HIGH);
        break;
      }
    case 5: {
        break;
      }
    case 9: {
        break;
      }
    case 10: {
        break;
      }
    case 12: {
        break;
      }
    case 13: {
        break;
      }
    case 14: {
        break;
      }
    case 15: {
        break;
      }
    default:
      // if nothing else matches, do the default
      // default is optional
      break;
  }
  Serial.print("INTERRUPT ok - ");
  Serial.println(pin);
}

void initHardware()
{
  Serial.begin(115200);
}